* cics-crucible condition-handling / hc-handle-aid
DEFINE PROGRAM(HCAID) GROUP(CRUCHC5) LANGUAGE(COBOL)
DEFINE TRANSACTION(HA01) GROUP(CRUCHC5) PROGRAM(HCAID)
DEFINE TRANSACTION(HA02) GROUP(CRUCHC5) PROGRAM(HCAID)
DEFINE TRANSACTION(HA03) GROUP(CRUCHC5) PROGRAM(HCAID)
DEFINE TRANSACTION(HA04) GROUP(CRUCHC5) PROGRAM(HCAID)
DEFINE TRANSACTION(HA05) GROUP(CRUCHC5) PROGRAM(HCAID)
DEFINE TRANSACTION(HA06) GROUP(CRUCHC5) PROGRAM(HCAID)
DEFINE TRANSACTION(HA07) GROUP(CRUCHC5) PROGRAM(HCAID)
