* cics-crucible condition-handling / hc-ignore-error
DEFINE PROGRAM(HCIGN) GROUP(CRUCHC6) LANGUAGE(COBOL)
DEFINE TRANSACTION(IE01) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE02) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE03) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE04) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE05) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE06) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE07) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE08) GROUP(CRUCHC6) PROGRAM(HCIGN)
DEFINE TRANSACTION(IE09) GROUP(CRUCHC6) PROGRAM(HCIGN)
