* cics-crucible ghost-tasks / gt-start-options
DEFINE PROGRAM(GTOPTS) GROUP(CRUCGT3) LANGUAGE(COBOL)
DEFINE PROGRAM(GTREAD) GROUP(CRUCGT3) LANGUAGE(COBOL)
DEFINE PROGRAM(GTRTRN) GROUP(CRUCGT3) LANGUAGE(COBOL)
DEFINE TRANSACTION(GT21) GROUP(CRUCGT3) PROGRAM(GTOPTS)
DEFINE TRANSACTION(GT22) GROUP(CRUCGT3) PROGRAM(GTREAD)
DEFINE TRANSACTION(GT23) GROUP(CRUCGT3) PROGRAM(GTRTRN)
