***********************************************************************
* cics-crucible  pseudo-conversational / pc-aid-menu   (Apache-2.0)
* Mapset PCSET2: PCMN (menu), PCDT (detail).
***********************************************************************
PCSET2   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               TIOAPFX=YES,CTRL=(FREEKB)
PCMN     DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,1),LENGTH=9,ATTRB=(ASKIP,BRT),                  X
               INITIAL='MAIN MENU'
         DFHMDF POS=(3,1),LENGTH=7,ATTRB=(ASKIP,NORM),INITIAL='OPTION:'
OPT      DFHMDF POS=(3,10),LENGTH=1,ATTRB=(UNPROT,NORM,IC,FSET),       X
               JUSTIFY=(LEFT,BLANK)
         DFHMDF POS=(3,12),LENGTH=1,ATTRB=(ASKIP,NORM)
         DFHMDF POS=(5,1),LENGTH=7,ATTRB=(ASKIP,NORM),INITIAL='VISITS:'
VISITS   DFHMDF POS=(5,10),LENGTH=4,ATTRB=(ASKIP,NORM)
MSG      DFHMDF POS=(7,1),LENGTH=40,ATTRB=(ASKIP,NORM)
         DFHMDF POS=(24,1),LENGTH=34,ATTRB=(ASKIP,NORM),               X
               INITIAL='1=XCTL 2=NEXT PF5=REFRESH PF3=EXIT'
PCDT     DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,1),LENGTH=6,ATTRB=(ASKIP,BRT),INITIAL='DETAIL'
         DFHMDF POS=(3,1),LENGTH=7,ATTRB=(ASKIP,NORM),INITIAL='VISITS:'
DVISITS  DFHMDF POS=(3,10),LENGTH=4,ATTRB=(ASKIP,NORM)
         DFHMDF POS=(4,1),LENGTH=5,ATTRB=(ASKIP,NORM),INITIAL='LAST:'
DLAST    DFHMDF POS=(4,10),LENGTH=4,ATTRB=(ASKIP,NORM)
         DFHMDF POS=(5,1),LENGTH=5,ATTRB=(ASKIP,NORM),INITIAL='TRAN:'
DTRAN    DFHMDF POS=(5,10),LENGTH=4,ATTRB=(ASKIP,NORM)
DMSG     DFHMDF POS=(7,1),LENGTH=40,ATTRB=(ASKIP,NORM)
         DFHMSD TYPE=FINAL
         END
